app/views/notifications/_notification_center.html.erb

SELECT "notifications".* FROM "notifications"
---
  <a href="#" id="open_notification">
    <%= render 'notifications/counter', counter: notifications.count %>