app/views/users/index.html.erb

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND (friend_id = 1 AND user_id = 2) ORDER BY "friendships"."id" ASC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 AND "friendships"."user_id" = $3 LIMIT $4  [["user_id", 1], ["friend_id", 1], ["user_id", 1], ["LIMIT", 1]]
---

        <% friend_status = current_user.friendships.exists?(:friend_id =>user.id, :user_id => current_user.id)  ? true : false %>