app/views/friendships/index.html.erb

SELECT "friendships".* FROM "friendships"
---

        <% friend_status = current_user.friendships.exists?(:friend_id =>user.id, :user_id => current_user.id)  ? true : false %>