app/views/orders/index.html.erb

      <tr>
        <td><%= order.orderT %></td>
---
SELECT "orders".* FROM "orders"