app/controllers/friendships_controller.rb

  def index
    @friendships = Friendship.all
---
SELECT "friendships".* FROM "friendships"

  def create
    # @user = User.find(params[:friend_id])
  # for friendship in @user.friendships
  #  friendship.friend.username
  @friendship = Friendship.new(friendship_params)

    # @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
  if @friendship.save
---
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["friend_id", 1], ["created_at", 2017-04-03 02:50:54 UTC], ["updated_at", 2017-04-03 02:50:54 UTC]]

  def update
    respond_to do |format|
      if @friendship.update(friendship_params)
---
UPDATE "friendships" SET "friend_id" = $1, "updated_at" = $2 WHERE "friendships"."id" = $3  [["friend_id", 3], ["updated_at", 2017-04-02 19:36:52 UTC], ["id", 2]]

  def destroy
  @friendship = current_user.friendships.find(params[:id])
  @friendship.destroy
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 1]]

    def set_friendship
      @friendship = Friendship.find(params[:id])
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]