app/controllers/mygroups_controller.rb

  def index
    @mygroup=Mygroup.new
     @mygroups = Mygroup.all
---
SELECT "mygroups".* FROM "mygroups"

  def show
    @mygroup=Mygroup.new
     @mygroups = Mygroup.all
    @usergroup=GroupMember.all
    @users=User.all
    @selectedgroup=Mygroup.find(params[:id])
---
SELECT "mygroups".* FROM "mygroups"
SELECT "group_members".* FROM "group_members"
SELECT "users".* FROM "users"
SELECT  "mygroups".* FROM "mygroups" WHERE "mygroups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    # @mygroup = current_user.mygroups.build(mygroup_params)
    # @mygroup.user_id = current_user.id
    #
     @mygroup = Mygroup.new(mygroup_params)

    respond_to do |format|
      if @mygroup.save
---
INSERT INTO "mygroups" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "g1"], ["user_id", 2], ["created_at", 2017-04-04 03:03:48 UTC], ["updated_at", 2017-04-04 03:03:48 UTC]]

  def destroy
     @mygroup = Mygroup.find(params[:id])
    @mygroup.destroy
---
SELECT  "mygroups".* FROM "mygroups" WHERE "mygroups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "mygroups" WHERE "mygroups"."id" = $1  [["id", 2]]

  def new_member


    @email = params[:user][:email]
    @group_id=params[:group_id]
    @mygroup = Mygroup.find(params[:id])
    if @email !=""
     @user = User.find_by_email(@email)
      if @user != nil
       if current_user != @user.id
            @userfound = GroupMember.where(:user_id => @user.id , :mygroup_id => @mygroup.id)
            if @userfound.exists? == false
                @GroupMember = GroupMember.new(
                mygroup_id: @mygroup.id,
                user_id: @user.id )
              if @GroupMember.save
---
SELECT  "mygroups".* FROM "mygroups" WHERE "mygroups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "fardosrageh111@yahoo.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "group_members" WHERE "group_members"."user_id" = $1 AND "group_members"."mygroup_id" = $2 LIMIT $3  [["user_id", 2], ["mygroup_id", 1], ["LIMIT", 1]]
INSERT INTO "group_members" ("mygroup_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["mygroup_id", 1], ["user_id", 2], ["created_at", 2017-04-04 13:10:34 UTC], ["updated_at", 2017-04-04 13:10:34 UTC]]

  def delete_member
    @GroupMember = GroupMember.find(params[:id])
    if @GroupMember.destroy
---
SELECT  "group_members".* FROM "group_members" WHERE "group_members"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "group_members" WHERE "group_members"."id" = $1  [["id", 1]]