app/controllers/orders_controller.rb

  def index
    # @orders = Order.all
    @orders = current_user.orders.all
---
SELECT "orders".* FROM "orders"

  def create
    # @order = Order.new(order_params)
    @order = current_user.orders.new(order_params)

    # respond_to do |format|
      if @order.save
      #   format.html { redirect_to @order, notice: 'Order was successfully created.' }
      #   format.json { render :show, status: :created, location: @order }
      # else
      #   format.html { render :new }
      #   format.json { render json: @order.errors, status: :unprocessable_entity }
      # end
      params[:invited_users].each do |u_id|
        @inv_friend = current_user.friendships.find u_id.to_i
        @order.invited_users << @inv_friend
      end
      params[:invited_groups].each do |g_id|
        @group = current_user.groups.find g_id.to_i
        @group.members.each do |group_member|
          begin
            @order.invited_users.find group_member.to_i
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]