app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "fardos"], ["password", "123456"], ["email", "fardos@mail.com"], ["created_at", 2017-03-31 08:02:56 UTC], ["updated_at", 2017-03-31 08:02:56 UTC]]